---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyFromDetailToProfileFam
source: html/261ed2ec-d966-b84d-9228-6e50eb2a9d6b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CantCopyFromDetailToProfileFam Property

Can't copy Detail element(s) into a Profile family.

## Syntax (C#)
```csharp
public static FailureDefinitionId CantCopyFromDetailToProfileFam { get; }
```